app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("script", "created_at", "updated_at") VALUES (?, ?, ?)  [["script", "Yes!"], ["created_at", "2017-09-05 11:35:23.170425"], ["updated_at", "2017-09-05 11:35:23.170425"]]