app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("script", "created_at", "updated_at") VALUES (?, ?, ?)  [["script", "Want to answer a Question?"], ["created_at", "2017-09-05 10:59:41.486078"], ["updated_at", "2017-09-05 10:59:41.486078"]]