app/controllers/rounds_controller.rb

SELECT "rounds".* FROM "rounds"
---
  def index
    @rounds = Round.all

SELECT  "questions".* FROM "questions" ORDER BY "questions"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "messages".* FROM "messages" ORDER BY "messages"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
---
  def show
    @questions = Question.all
    @messages = Message.all

INSERT INTO "rounds" ("number", "created_at", "updated_at") VALUES (?, ?, ?)  [["number", 1], ["created_at", "2017-09-05 13:32:28.682928"], ["updated_at", "2017-09-05 13:32:28.682928"]]
---
  def create
    @round = Round.new(round_params)

    respond_to do |format|
      if @round.save

DELETE FROM "rounds" WHERE "rounds"."id" = ?  [["id", 6]]
---
  def destroy
    @round.destroy

SELECT  "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_round
      @round = Round.find(params[:id])