app/controllers/welcome_controller.rb

  def index
    @questions = Question.all
    @messages = Message.all
---
SELECT "questions".* FROM "questions"
SELECT "messages".* FROM "messages"